# Дан список чисел. Определите, сколько в 
# нем встречается различных чисел
# [1, 1, 2, 3, 4, 4] -> 4

# a = set(input().split())
# print(len(a))

our_set = [1, 1, 2, 3, 4, 4]

print(len(set(our_set)))
